# 下标我们又称之为索引，表示第几个数据
# 可迭代对象: str  list  tuple  dict  set
# 字符串是不可变类型
# 对于字符串的任何操作，都不会改变原有的字符串
word = "zhangsan"
print(word[4])  # world[index] ==>获取指定下标上的数据

# 切片就是从字符串里复制一段指定的内容，生成一个新的字符串
m = "abcdefghijklmnopqrstuvwxyz"
# 切片语法 m[start:end:step]
# 区间始终是左闭右开
# 负数索引从-1开始
# 步长正数从左往右截取,步长为负数从又往左截取,截取方向与索引方向一致.
print(m[2:9])  # m[start:end] [start,end) 左闭右开
print(m[2:])   # 如果只包含start,会截取从起始字符到最后一个字符
print(m[:9])   # 如果只包含end,则截取[0,end)区间内的字符
print(m[::2])  # 只设置步长
# print(m[2:9:0])  # 步长不能为0
print("----------------")
# print(m[2:9:-1])  # 空白,步长为负数，索引需要颠倒
print(m[9:2:-1])  # 步长为负数,则从右往左截取,索引顺序从右到左
print(m[::])  # 从头到尾打印 等效于[0::1]
print(m[::-1])  # 倒叙打印
print(m[-9:-2])  # 索引为负数, 从右往左数,步长为正数，截取从左往右
print(m[-2:-9:-1])  # 索引为负数, 从右往左数,步长为负数，截取从右往左

